//
//  HolidayAndDay.swift
//  KolyadiDar
//
//  Created by Maksim Pavlov on 20.05.2020.
//  Copyright © 2020 Maksim Pavlov. All rights reserved.
//

import Foundation

struct HolidayAndDay {
    let holidays: Dictionary<Int, String> = [
        1 : "НОВОЛЕТИЕ", 4 : "День Ивана Омийского", 6 : "ПРАЗДНИК УРОЖАЯ", 9 : "День Сергия Странника",
        11 : "День Ольги Премудрой", 14 : "ДЕНЬ ВЕЛИКОЙ РАССЕНИИ", 16 : "День Василия Буслаева", 19 : "День Хария Мудрого",
        22 : "ДЕНЬ ВЕЛИКОГО ЗНАНИЯ", 24 : "День Трояна", 27 : "ДЕНЬ СВЯТИБОРА", 31 : "День Моисия Волхва",
        36 : "День Сканда Ирийского", 38 : "ДЕНЬ БОГИНИ РОЖАНЫ", 40 : "День Мудрых Странников", 43 : "День Мирослава Тарийского",
        45 : "День Хария Предвечного", 48 : "День Родамира Тарийского", 53 : "ДЕНЬ БОГИНИ МАКОШИ", 54 : "День Олега Воителя",
        57 : "День Почитания Волхвов", 60 : "День Аристарха Мудрого", 63 : "ДЕНЬ ОТКРОВЕНИЯ БОГОВ", 66 : "ДЕНЬ СВАРОГА И СЕМАРГЛА",
        70 : "День Ярослава Мироустроителя", 73 : "День Хорива Мудрого", 77 : "День Олега Праведного", 82 : "ДЕНЬ ДАЖДЬБОГА И МАРЕНЫ",
        85 : "День Марьяны и Марены", 88 : "День Успокоения", 94 : "ДЕНЬ ПЕРЕМЕН, КОЛЯДА", 99 : "ДЕНЬ СПАСИТЕЛЯ РАСЫ",
        101 : "День Всеволода Вечного", 103 : "День Великого Покоя", 104 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ", 105 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ",
        106 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ", 107 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ", 108 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ", 109 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ",
        110 : "РОДОГОЩЬ", 111 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ", 112 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ", 113 : "НЕДЕЛЯ ПАМЯТИ ПРАОТЦЕВ",
        114 : "ДЕНЬ БОГА ПЕРУНА", 119 : "День Александра Основателя", 124 : "День Винитара Воителя", 129 : "День Горислава Мученика",
        134 : "День Светозара Вечного", 139 : "День Хария Праведного", 155 : "ДЕНЬ ДИДА", 159 : "ДЕНЬ БОГА ВЕЛЕСА",
        162 : "ДЕНЬ ХРАМА ДУШИ", 164 : "День Вечезара Мученика", 167 : "День Аристарха Воителя", 168 : "День Боруслава Асгардского",
        176 : "День Ратибора Странника", 179 : "День Димитрия Капена", 181 : "День Игоря Воителя", 184 : "ДЕНЬ ВЕСТЫ, БОГИНИ ВЕСНЫ",
        185 : "КРАСНОГОР. МАСЛЕНИЦА", 186 : "День Хария Мученика", 187 : "День Богуслава Мученика", 188 : "День Трислава Воителя",
        189 : "День Леды Воительницы", 190 : "ДЕНЬ БОГИНИ ТАРЫ", 191 : "День Светозара Спасителя", 192 : "День Сергия Лучезарного",
        193 : "День Ратислава Асгардского", 194 : "День Руслана Воителя", 195 : "День Одина Асгардского", 196 : "День Тора Свентогардского",
        197 : "ДЕНЬ ПАМЯТИ ПРЕДКОВ", 198 : "ПАСХЕТЪ", 199 : "ДЕНЬ МИТРЫ СПАСИТЕЛЯ", 200 : "ДЕНЬ ВОЗРОЖДЕНИЯ ТАРХА",
        202 : "День Айвана Вечного", 204 : "День Наречения", 205 : "День Наречения", 206 : "День Наречения",
        207 : "День Вечеслава Ирийского", 208 : "День Наречения", 209 : "День Наречения", 210 : "День Наречения",
        211 : "День Наречения", 212 : "День Наречения", 213 : "День Наречения", 214 : "День Аристарха Праведника",
        215 : "День Наречения", 216 : "ДЕНЬ ЛЕЛИ НЕБЕСНОЙ", 217 : "День Наречения", 218 : "День Наречения",
        219 : "День Борислава Спасителя", 220 : "День Наречения", 221 : "День Наречения", 222 : "День Родомира Ведуна",
        223 : "День Наречения", 224 : "День Наречения", 225 : "ДЕНЬ МУДРОСТИ КРЫШЕНЯ", 226 : "День Наречения",
        227 : "День Наречения", 228 : "День Наречения", 229 : "СВЯТОЧЪ", 230 : "День Наречения",
        231 : "День Наречения", 232 : "День Ведамира Асгардского", 233 : "День Наречения", 234 : "День Наречения",
        235 : "День Наречения", 236 : "ВЕДА-ИНТА", 237 : "День Наречения", 238 : "День Наречения",
        239 : "День Наречения", 240 : "ДЕНЬ МАТЕРИ-СЫРОЙ-ЗЕМЛИ", 241 : "День Наречения", 242 : "День Наречения",
        243 : "ДЕНЬ ЛАДЫ БОГОРОДИЦЫ", 248 : "День Всеволода Мудрого", 252 : "ДЕНЬ БОГА ВЫШЕНЯ", 255 : "ДЕНЬ БОГА ЯРОВИТА",
        257 : "День Ратибора Воителя", 261 : "День Мудрости Будха", 265 : "РА-М-ХА-ИНТА", 268 : "День Ведаслава Праведника",
        270 : "ТРИГЛАВ", 273 : "РОДОНИЦА", 274 : "ДЕНЬ ЧИСЛОБОГА", 275 : "ДЕНЬ ЛАДААДА",
        276 : "ДЕНЬ БОГА ХОРСА", 277 : "День Ясуни", 278 : "День Родовита", 279 : "День Позвизда",
        280 : "День Родарита", 281 : "День Родагоста", 282 : "День Крода", 283 : "РУСАЛИИ",
        284 : "РУСАЛИИ", 285 : "РУСАЛИИ", 286 : "ДЕНЬ ЯРИЛЫ-СОЛНЦА", 287 : "День Омовения",
        288 : "РУСАЛИИ", 289 : "РУСАЛИИ", 290 : "РУСАЛИИ", 291 : "ДЕНЬ БОГА КУПАЛА",
        292 : "ДЕНЬ ЗАРИ-МЕРЦАНЫ", 293 : "ДЕНЬ ПОЧИТАНИЯ ВЕЛИКОГО СВЕТА", 297 : "День Александра Странника", 301 : "ДЕНЬ ЗЕМЛИ СВЯТА РАСЫ",
        302 : "День Орея Вендагардского", 305 : "ПЕРУНИЦА", 306 : "ДЕНЬ СБОРА ПЛОДОВ", 311 : "ДЕНЬ БОГА УДРЗЕЦА",
        314 : "День Игоря Святомудрого", 317 : "ВЫШНИЙ ДЕНЬ ПЕРУНА", 318 : "ДЕНЬ ЛЕТИНИЦЫ", 319 : "РИТА",
        322 : "День Александра Ярославича", 324 : "ЖИТНИЧЪ", 327 : "ДЕНЬ ВОРОНА ВАРУНЫ", 330 : "День Александра Мудрого",
        333 : "ДЕНЬ ТРЕХ ЛУН", 336 : "День Скифия Волхва", 340 : "День Дмитрия Основателя", 342 : "ДЕНЬ СТРИБОГА",
        345 : "ЗЛАТОГОРКА", 346 : "ЛЮБОМИР (ДЕНЬ СВАДЕБ)", 348 : "День Свентослава Асгардского", 351 : "ДЖИВА-ИНТА",
        353 : "ДЕНЬ ЖЕЛИ", 355 : "День Святослава Праведного", 357 : "СЕЧЕННИК", 359 : "ДЕНЬ БОГИНИ КАРНЫ",
        362 : "День Светозара Странника", 365 : "День Александра Вещего"]
    
    
    let datesOfPosts1: [Int] = [23, 24, 25, 26, 27, 28, 29, 30, 31]
    
    let datesOfPosts2: [Int] = [82, 83 ,84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
    
    let datesOfPosts2_16: [Int] = []
    
    let datesOfPosts3: [Int] = [145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162]
    
    let datesOfPosts3_16: [Int] = []
    
    let datesOfPosts4: [Int] = [186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197]
    
    let datesOfPosts4_16: [Int] = []
    
    let datesOfPosts5: [Int] = [275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292]
    
    let datesOfPosts5_16: [Int] = []
    
    
    
    
    let daysOfParrents: [Int] = [14, 27, 38, 53, 66, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 144, 155, 159, 162, 179, 197, 198, 199, 200, 216, 222, 232, 240, 243, 252, 265, 270, 273, 282, 293, 301, 311, 318, 319, 327, 342, 351, 353, 357, 359]
    
    let daysOfParrents_16: [Int] = []
    
    let daysOfMemory: [Int] = [9, 16, 24, 36, 40, 45, 57, 70, 77, 88, 94, 99, 129, 134, 139, 167, 176, 181, 207, 214, 229, 236, 248, 257, 261, 268, 292, 297, 314, 322, 330, 336, 348, 355, 365]
    
    let daysOfMemory_16: [Int] = []
}
